[Killed] BlockStatement
src/converterCelsius.js:2:23
 class ConverterCelsius {
-  convert(fahrenheit) {
-    if (fahrenheit === null || fahrenheit === undefined) {
-      throw new Error('Invalid input');
-    }
-    return ((fahrenheit - 32) * 5) / 9; //adding a comment
-  }
+  convert(fahrenheit) {}
 }
 
killedBy: Converter - Fahrenheit to Celsius should convert Fahrenheit to Celsius
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
src/converterCelsius.js:3:9
 class ConverterCelsius {
   convert(fahrenheit) {
-    if (fahrenheit === null || fahrenheit === undefined) {
+    if (fahrenheit !== null || fahrenheit === undefined) {
       throw new Error('Invalid input');
     }
killedBy: Converter - Fahrenheit to Celsius should convert Fahrenheit to Celsius
statusReason: Error: Invalid input

[Killed] ConditionalExpression
src/converterCelsius.js:3:9
 class ConverterCelsius {
   convert(fahrenheit) {
-    if (fahrenheit === null || fahrenheit === undefined) {
+    if (true) {
       throw new Error('Invalid input');
     }
killedBy: Converter - Fahrenheit to Celsius should convert Fahrenheit to Celsius
statusReason: Error: Invalid input

[Killed] ArithmeticOperator
src/converterCelsius.js:6:13
     if (fahrenheit === null || fahrenheit === undefined) {
       throw new Error('Invalid input');
     }
-    return ((fahrenheit - 32) * 5) / 9; //adding a comment
+    return ((fahrenheit - 32) / 5) / 9; //adding a comment
   }
 }
killedBy: Converter - Fahrenheit to Celsius should convert Fahrenheit to Celsius
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 4

[Killed] ArithmeticOperator
src/converterCelsius.js:6:12
     if (fahrenheit === null || fahrenheit === undefined) {
       throw new Error('Invalid input');
     }
-    return ((fahrenheit - 32) * 5) / 9; //adding a comment
+    return (fahrenheit - 32) * 5 * 9; //adding a comment
   }
 }
killedBy: Converter - Fahrenheit to Celsius should convert Fahrenheit to Celsius
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 8100
