[Killed] BlockStatement
src/converterFahrenheit.js:2:20
 class ConverterFahrenheit {
-  convert(celsius) {
-    
-    if (celsius === null || celsius === undefined) {
-      throw new Error('Invalid input');
-    }
-    return (celsius * 9) / 5 + 32;
-  }
+  convert(celsius) {}
 }
 
killedBy: Converter - Celsius to Fahrenheit should convert Celsius to Fahrenheit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 32
Received: undefined

[Killed] ConditionalExpression
src/converterFahrenheit.js:4:9
 class ConverterFahrenheit {
   convert(celsius) {
     
-    if (celsius === null || celsius === undefined) {
+    if (true) {
       throw new Error('Invalid input');
     }
killedBy: Converter - Celsius to Fahrenheit should convert Celsius to Fahrenheit
statusReason: Error: Invalid input

[Killed] EqualityOperator
src/converterFahrenheit.js:4:9
 class ConverterFahrenheit {
   convert(celsius) {
     
-    if (celsius === null || celsius === undefined) {
+    if (celsius !== null || celsius === undefined) {
       throw new Error('Invalid input');
     }
killedBy: Converter - Celsius to Fahrenheit should convert Celsius to Fahrenheit
statusReason: Error: Invalid input

[Killed] ArithmeticOperator
src/converterFahrenheit.js:7:13
     if (celsius === null || celsius === undefined) {
       throw new Error('Invalid input');
     }
-    return (celsius * 9) / 5 + 32;
+    return (celsius / 9) / 5 + 32;
   }
 }
killedBy: Converter - Celsius to Fahrenheit should convert Celsius to Fahrenheit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 212
Received: 34.22222222222222

[Killed] ArithmeticOperator
src/converterFahrenheit.js:7:12
     if (celsius === null || celsius === undefined) {
       throw new Error('Invalid input');
     }
-    return (celsius * 9) / 5 + 32;
+    return celsius * 9 * 5 + 32;
   }
 }
killedBy: Converter - Celsius to Fahrenheit should convert Celsius to Fahrenheit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 212
Received: 4532
